/****************************************************************************/
/* Localization file */

"general.buttons.ok-title" = "OK";
"general.buttons.cancel-title" = "Cancel";
"general.buttons.retry-title" = "Retry";
"general.buttons.replace-title" = "Replace";
"general.buttons.upload-title" = "Upload";
"general.buttons.choose-image-title" = "Choose Image";

"Click & drag to save an image wherever you want in PNG format" = "Click and drag to save an image wherever you want in PNG format";
"Current Page cannot be shown in Vector preview because it contains one or more slayer with a blur filter.\n\nDo you want to select those layers that are preventing Vector preview mode?" = "Current Page cannot be shown in Vector preview because it contains one or more layers with a blur filter.\n\nDo you want to select those layers that are preventing Vector preview mode?";
"Pixel Mode cannot be disabled" = "Pixel Mode cannot be disabled";

"views.pagelist.contextmenu.duplicate" = "Duplicate Page";
"views.pagelist.contextmenu.delete" = "Delete Page";

// Tooltips
"views.pagelist.toggle.tooltip.hide" = "Hide Page List";
"views.pagelist.toggle.tooltip.show" = "Show Page List";

// The message asking whether to delete a page - without symbols
"views.messages.confirm-page-delete.message" = "Do you want to delete page \“%@\”?";
"views.messages.confirm-page-delete.info" = "All layers on this page will also be removed.";
"views.messages.confirm-page-delete.confirm" = "Delete";

// The message asking whether to delete a page - with symbols
"views.messages.confirm-page-with-symbols-delete.message" = "Do you want to delete page \“%@\”?";
"views.messages.confirm-page-with-symbols-delete.info" = "This page contains Symbols. Symbol instances on other pages will be converted into groups.";
"views.messages.confirm-page-with-symbols-delete.confirm" = "Delete";

// The message warning when cutting layers with Symbol Masters among them
"views.messages.confirm-symbol-cut.message" = "Are you sure you want to Cut?";
"views.messages.confirm-symbol-cut.info" = "If you cut a Symbol from this document, its instances will convert into groups.";
"views.messages.confirm-symbol-cut.confirm" = "Cut";

// dialog when detaching artboards
"symbols.remove.alert.message" = "Are you sure you want to delete this Symbol?";
"symbols.remove.alert.info" = "This will change this Symbol’s instances into groups, and edits will not update between copies. The Artboard will be deleted.";
"symbols.remove.alert.confirm" = "Delete";

"views.instances.missing-artboards" = "Symbol is Missing";
"views.instances.multiple-artboards" = "Multiple Symbols";
"views.instances.detach-from-symbol" = "Detach from Symbol";
"views.instances.remove-symbol" = "Remove Symbol";
"symbols.image-override.tooltip" = "Drag an image from the Finder to replace the image in this instance";
"symbols.image-override.context-menu" = "Remove Image Override";

// dialog when creating a Symbol from an Artboard
"symbols.create-from-artboard.alert.message" = "Creating a Symbol from an Artboard";
"symbols.create-from-artboard.alert.info" = "You are about to convert an Artboard into a Symbol. You will now be able to insert instances of this Symbol into your design via the Insert menu.";

// Messages when opening a document with missing fonts
"alerts.missing-fonts.opening-will-change-fonts" = "If you choose to open the document anyway, the missing fonts will be subsituted by other fonts.";
"alerts.missing-fonts.opening-will-preserve-fonts" = "Opening the document will preserve missing fonts as long as those text layers are not edited.";

// menu item titles for the boolean operations popup menu in the layer list
"views.layerlist.boolean-op-menu.none" = "None";
"views.layerlist.boolean-op-menu.union" = "Union";
"views.layerlist.boolean-op-menu.subtract" = "Subtract";
"views.layerlist.boolean-op-menu.intersect" = "Intersect";
"views.layerlist.boolean-op-menu.difference" = "Difference";

"views.layerlist.dragging.invalid-layer-name-substituate" = "Dragged Layer";

// Shape Editor
"views.inspector.shape.dragging-mode" = "Activate to select one or more points by dragging on the canvas";
"views.inspector.shape.button.open-path" = "Open Path";
"views.inspector.shape.button.close-path" = "Close Path";
"views.inspector.shape.vectorPointMode.none" = "Round: None";
"views.inspector.shape.vectorPointMode.half-pixel" = "Round: Half Pixels";
"views.inspector.shape.vectorPointMode.full-pixel" = "Round: Full Pixels";

// Reducing image size
"actions.reduceimage.destructive-warning.message" = "Reduce image size and quality?";
"actions.reduceimage.destructive-warning.informative-text" = "This action reduces not only the size of an image but also its quality.";
"actions.reduceimage.destructive-warning.reduce-button-title" = "Reduce";

// Export
"export.initial-slice-alert.message" = "Export Selection";
"export.initial-slice-alert.info" = "Do you want to export the entire canvas or only the selection?";
"export.initial-slice-alert.button.export-canvas" = "Export Canvas";
"export.initial-slice-alert.button.export-selection" = "Export Selection";
"export.initial-slice-alert.button.cancel" = "Cancel";

"views.slice-drag.tooltip" = "Drag and drop outside Sketch to Export this Slice";

"menus.plugins.untitled-script-title" = "untitled script";
"menus.plugins.untitled-submenu-title" = "untitled";

"preferences.toolbar.canvas-item-title" = "Canvas";
"preferences.toolbar.general-item-title" = "General";
"preferences.toolbar.layers-item-title" = "Layers";
"preferences.toolbar.cloud-item-title" = "Cloud";

/* Alert for distribute */
"distribute.alert.message" = "Unable to distribute layers evenly using full pixels.";
"distribute.alert.info" = "Do you want to place some of the selected layers on sub-pixel values?";
"distribute.alert.place-on-subpixel" = "Place on sub-pixels";
"distribute.alert.place-unevenly" = "Distribute unevenly";

/* Preferences toolbar item title: Plugins */
"preferences.plugins.title" = "Plugins";
"preferences.plugins.legacy-plugins" = "Legacy Plugins";

"preferences.plugins.show-plugins-folder" = "Show Plugins Folder";
"preferences.plugins.plugin-is-enabled" = "Enabled";
/* @"Checkbox label: Enable <plugin name>"*/
"preferences.plugins.plugin-enable" = "Enable “%@”";
"preferences.plugins.plugin-uninstall" = "Uninstall “%@”";
"preferences.plugins.plugin-show-in-finder" = "Show in Finder";
"preferences.plugins.plugin-edit-code" = "Edit Code…";
"preferences.plugins.plugin-view-docs" = "View “%@” Documentation";
"preferences.plugins.plugins-uninstall" = "Uninstall %i plugins";

/* Button title: move plugin to the trash */
"preferences.plugins.plugin-move-to-trash" = "Move to Trash";

/* Label title: plugins matching search string not found */
"preferences.plugins.plugins-not-found-title" = "Plugin Not Found";

/* Label title: advise the user why no plugins have been found. */
"preferences.plugins.plugins-not-found-text" = "No installed plugins match the search “%@”";

/* Label title: the user has no plugins installed */
"preferences.plugins.plugins-none-installed-title" = "No Plugins Installed";

/* Label title: advise the user how to find plugins. */
"preferences.plugins.plugins-none-installed-text" = "You can find plugins by clicking “Get Plugins…” below.";

/* Alert sheet message text: uninistall <count> plugins */
"preferences.plugins.plugins-uninstall-confirm" = "Are you sure you want to uninstall %i plugins?";

/* Alert sheet message text: uninistall <plugin name> */
"preferences.plugins.plugin-uninstall-confirm" = "Are you sure you want to uninstall “%@”?";

/* Alert sheet message title: Plugin Installed */
"preferences.plugins.plugin-installed-title" = "Plugin Installed";

/* Alert sheet message title: Plugin <plugin name, version> Installed */
"preferences.plugins.plugin-installed-title-format" = "Plugin “%@” Installed";

/* Alert sheet message text */
"preferences.plugins.plugin-installed-text" = "The plugin has been installed successfully. You can now access it via the Plugins menu.";

/* Alert sheet message title */
"preferences.plugins.plugin-installed-already-title-format" = "Plugin “%@” Already Installed";

/* Alert sheet message text */
"preferences.plugins.plugin-installed-already-text-format" = "Do you want to replace it with “%@”?";

/* Misc Errors */
"errors.save-as-template" = "Error Saving as Template";

/* The titles of menu items in the right-click context menu */
"menus.context.layerlist.mask" = "Mask";
"menus.context.layerlist.ignore-mask" = "Ignore Underlying Mask";
"menus.context.pick-layer" = "Pick Layer";

/* Cut copy paste menu items */
"menus.context.cut" = "Cut";
"menus.context.copy" = "Copy";
"menus.context.paste-here" = "Paste Here";
"menus.context.paste-over" = "Paste Over";
"menus.context.duplicate" = "Duplicate";
"menus.context.delete" = "Delete";

/* Enhanced copy / paste items */
"menus.context.copy.style" = "Copy Style";
"menus.context.paste.style" = "Paste Style";
"menus.context.copy.css" = "Copy CSS Attributes";
"menus.context.copy.svg" = "Copy SVG Code";

/* Export formats */
"menus.export.make-exportable" = "Make Exportable";
"menus.export.add-size" = "Add New Export Size";

/* Plugins Menu */

"menus.plugins.custom" = "Custom Plugin…";
"menus.plugins.last" = "Run Last Plugin…";
"menus.plugins.again.format" = "Run ‘%@’ Again";
"menus.plugins.manage" = "Manage Plugins…";
"menus.plugins.reveal" = "Reveal Plugins Folder";
"menus.plugins.edit" = "Edit Plugins…";

/* Publisher Online and Local */
"publisher.failed.alert.title" = "Upload Failed";
"publisher.failed.alert.text" = "The upload failed (error code “%li“).\n\nPlease try again";
"publisher.defaultname" = "Sketch Document";
"publisher.local.switch.preparing" = "Preparing Local Sharing…";
"publisher.local.switch.normal" = "Enable Local Sharing";

/* Undo action names */
"undo.add.page" = "Add Page";
"undo.boolean.none" = "Boolean Reset";
"undo.boolean.union" = "Boolean Union";
"undo.boolean.subtract" = "Boolean Subtract";
"undo.boolean.intersect" = "Boolean Intersect";
"undo.boolean.difference" = "Boolean Difference";
"undo.menus.context.paste-over" = "Over Selection";

/* License Manager Handler */
"licensemanager.popup-button" = "OK";
"licensemanager.license-expiring-title" = "License";
"licensemanager.license-expiring-text-format" = "Your license is going to expire in %d days. Please connect to the internet.";

"licensemanager.license-expired-title" = "Invalid License";
"licensemanager.license-expired-text" = "This license has expired, or is already being used by another device. Please purchase another license or contact support.";

"licensemanager.license-error-title" = "Cannot Verify License";
"licensemanager.license-error-text" = "Sketch has not been able to connect to the license server for some time. Please check your connection and try again.";

"actions.publish.label" = "Cloud";

/* Document loading errors */
"document.loading.too-new.message" = "Unable to Open File";
"document.loading.too-new.info" = "This document was created with a newer version of Sketch. Please upgrade to the latest version and try again.";

"document.loading.wrong-size.message" = "Unable to Open File";
"document.loading.wrong-size.info" = "This document appears to be incomplete (the size doesn’t match what we were expecting).\n\nIf you are sharing it with a service like Dropbox, please ensure that it has finished syncing.";

"document.loading.corruption-detected.message" = "Some problems needed to be fixed in this document.";
"document.loading.corruption-detected.info" = "It may be worth saving this as a new document or reverting to an earlier backup. Please consider sending the document to the Sketch support staff for testing.";

// TODO #6459 - finalise wording here
"document.loading.repair-metadata.message" = "Unable to Open File";
"document.loading.repair-metadata.info" = "This document appears to be missing some data.\n\nIf you are sharing it with a service like Dropbox, please ensure that it has finished syncing.\n\nIf the document is not being synced, you can attempt to open it anyway (but we might crash).";
"document.loading.repair-metadata.dont-open" = "Don’t Open";
"document.loading.repair-metadata.open" = "Try to Open Anyway";

// TODO #6459 - better text for this message?
"document.loading.old-version.message" = "Older versions of Sketch will not be able to read this file once it is saved. Unlock or duplicate it if you wish to modify it.";

"menu.register.sketch.label" = "Registered to %@";

/* Shared Styles */
"menu.styles.none" = "No %@";
"menu.styles.create" = "Create New %@";
"menu.styles.organize" = "Organize %@s";
"menu.styles.text-style" = "Text Style";
"menu.styles.shared-style" = "Shared Style";

/* Make Grid Sheet */
"make-grid.confirm.single" = "Make Grid";
"make-grid.confirm.multiple" = "Arrange";
"make-grid.subtext.single" = "Create copies of the selected object and turn those into a grid.";
"make-grid.subtext.multiple" = "Arrange the selected objects in a grid. Choose rows, columns and padding.";


/* MAS Migration */
"masmigration.corrupt.license.error-title" = "Unable to Verify Mac App Store Receipt";
"masmigration.corrupt.license.error-button" = "OK";
"masmigration.corrupt.license.error-text" = "We were unable to verify your Mac App Store copy of Sketch. To proceed, please follow these three steps:\n\n  1. Re-download Sketch on the Mac App Store via the Purchases tab\n  2. Quit this copy of Sketch, and launch the Mac App Store version\n  3. Open this copy of Sketch downloaded from our website and enter your email address once more";

/* Cloud */

"cloudshare.action.copy.url-text" = "Copy URL";
"cloudshare.action.open-in-safari-text" = "View Share";
"cloudshare.action.delete-text" = "Delete Share…";
"cloudshare.action.refresh-list-text" = "Refresh Upload List";
"cloudshare.delete.shares-title" = "Delete upload?";
"cloudshare.delete.shares-delete" = "Delete";
"cloudshare.delete.shares-cancel" = "Cancel";
"cloudshare.delete.shares-text" = "Are you sure you want to delete this upload? This action cannot be undone.";
"cloudshare.newsletter-failed-title"  = "Newsletter registration failed.";
"cloudshare.newsletter-ok"  = "OK";
"cloudshare.newsletter-failed-text"  = "Something went wrong while registering for our newsletter. Please try again via our website.";
"cloudshare.newsletter-successful-title"  = "Thanks for signing up to Sketch News!";
"cloudshare.newsletter-successful-ok"  = "OK";
"cloudshare.newsletter-successful-text"  = "Thank you for signing up to our bi-monthly newsletter. You will soon receive a confirmation via email.";

/* Clearing Guides */
"menu.clear-guides.vertical" = "Remove All Vertical Guides";
"menu.clear-guides.horizontal" = "Remove All Horizontal Guides";
